---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSectionsServiceData
source: html/5bb46529-85cf-18d8-d8ec-9b77c3b78f88.htm
---
# Autodesk.Revit.DB.Structure.StructuralSectionsServiceData

The data needed by section type server to perform type definition.

## Syntax (C#)
```csharp
public class StructuralSectionsServiceData : IDisposable
```